InformationRegisters/ВыгружаемыеДокументыВЦентрЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ВыгружаемыеДокументыВЦентрЭДО</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Ошибка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЭДО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭлектронныйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЭлектронныйДокументВходящийЭДО</v8:Type>
						<v8:Type>cfg:DocumentRef.ЭлектронныйДокументИсходящийЭДО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ВыгружаемыеДокументыВЦентрЭДО/Ext/ManagerModule.bsl
// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Параметры:
//  ИдентификаторЭДО - Строка
Процедура Очистить(ИдентификаторЭДО) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ИдентификаторЭДО.Установить(ИдентификаторЭДО);
	НаборЗаписей.Записать();
	
КонецПроцедуры

// Параметры:
//  ИдентификаторЭДО - Строка
//  ЭлектронныеДокументы - Массив из ДокументСсылка.ЭлектронныйДокументВходящийЭДО,ДокументСсылка.ЭлектронныйДокументИсходящийЭДО
Процедура ОтметитьКОбработке(ИдентификаторЭДО, ЭлектронныеДокументы) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	Для Каждого ЭлектронныйДокумент Из ЭлектронныеДокументы Цикл
		ЗаписьНабора = НаборЗаписей.Добавить();
		ЗаписьНабора.ИдентификаторЭДО = ИдентификаторЭДО;
		ЗаписьНабора.ЭлектронныйДокумент = ЭлектронныйДокумент;
	КонецЦикла;
	НаборЗаписей.Записать(Ложь);
	
КонецПроцедуры

// Параметры:
//  ИдентификаторЭДО - Строка
//  ЭлектронныйДокумент - ДокументСсылка.ЭлектронныйДокументВходящийЭДО,ДокументСсылка.ЭлектронныйДокументИсходящийЭДО
Процедура ОтметитьВыполнениеОбработки(ИдентификаторЭДО, ЭлектронныйДокумент) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ИдентификаторЭДО.Установить(ИдентификаторЭДО);
	НаборЗаписей.Отбор.ЭлектронныйДокумент.Установить(ЭлектронныйДокумент);
	НаборЗаписей.Записать();
	
КонецПроцедуры

// Параметры:
//  ИдентификаторЭДО - Строка
//  ЭлектронныйДокумент - ДокументСсылка.ЭлектронныйДокументВходящийЭДО,ДокументСсылка.ЭлектронныйДокументИсходящийЭДО
//  ОписаниеОшибки - Строка
Процедура ОтметитьОшибкуОбработки(ИдентификаторЭДО, ЭлектронныйДокумент, ОписаниеОшибки) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ИдентификаторЭДО.Установить(ИдентификаторЭДО);
	НаборЗаписей.Отбор.ЭлектронныйДокумент.Установить(ЭлектронныйДокумент);
	НаборЗаписей.Прочитать();
	
	ЗаписьНабора = ?(НаборЗаписей.Количество() > 0, НаборЗаписей[0], НаборЗаписей.Добавить());
	ЗаписьНабора.ИдентификаторЭДО = ИдентификаторЭДО;
	ЗаписьНабора.ЭлектронныйДокумент = ЭлектронныйДокумент;
	ЗаписьНабора.Ошибка = Истина;
	ЗаписьНабора.ОписаниеОшибки = ОписаниеОшибки;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
